In [ ]:
# Groupby allows you to group together rows based off of a column 
# & perform an aggregate function on them.

In [1]:
import numpy as np
import pandas as pd

In [2]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [3]:
df = pd.DataFrame(data)

In [8]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [14]:
byComp = df.groupby('Company')

In [15]:
byComp

In [17]:
byComp.mean()    # Pandas ignores a non-numeric column as it contains strings

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [18]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [19]:
byComp.std()     # Standard deviation

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [20]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [21]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [22]:
df.groupby('Company').count()   # counts the number of instances for a column

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [23]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [24]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [27]:
df.groupby('Company').describe()     # This will give a bunch of information

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [28]:
df.groupby('Company').describe().transpose()     # If you prefer each company to be a column

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000